Repository: myclabs/Inventory
Catalog: application/languages/TEC/interpreter.tmx
Source language: fr
Languages: en

source: Interpréteur d'expression
en: Expression interpreter

source: Type d'expression
en: Expression type

source: Caractères autorisés pour les opérandes
en: Authorized characters in operands

source: Expression arithmétique
en: Arithmetic expression

source: Expression booléenne
en: Boolean expression

source: (salade | soupe) & (viande | poisson) & dessert
en: (salad | soup) & (meat | fish) & dessert

source: Sélection
en: Selection

source: beau_temps : (soleil : chapeau_ ; chaleur : short) ; pluie : parapluie_ ; : chaussures
en: nice_weather : (sun : hat ; heat : shorts) ; rain : umbrella ; : shoes

source: L'expression n'a pas pu être interprétée.
en: Expression could not be interpreted.

source: L'expression est syntaxiquement correcte.
en: Expression syntax is proper.

source: Expression et arbre renvoyés
en: Returned expression and tree
